microservices/authentication_service/test/loadTest.yml
# https://artillery.io/docs/script-reference/
config:
  payload: #for csv files
    path: "users.csv"
    fields:
      - "usernames" #name of row in csv file
      - "passwords"
    order: "sequence" #"sequence" loops from first row to last
  http:
    pool: 5

  environments: #for re-use across different environments (dev, staging, production)
    dev: #command line: artillery run -e dev loadTest.yml
      target: "http://0.0.0.0:3000"  #"http://0.0.0.0:3002"
      phases:
        - duration: 5 # load phase lasting 5 seconds
          arrivalRate: 20   # 20 virtual users per second

scenarios:
  - name: 'Add users'
    flow:
    - post:
        url: "/signup"
        json:
          username: "{{ usernames }}"
          password: "{{ passwords }}"

# run: artillery run -e dev loadTest.yml

#####  DATA   ######


### Ran locally 5 seconds 200 AR ###

# Summary report @ 20:25:39(-0800) 2018-03-02
#   Scenarios launched:  1000
#   Scenarios completed: 1000
#   Requests completed:  1000
#   RPS sent: 11
#   Request latency:
#     min: 481.3
#     max: 85653.6
#     median: 43277.2
#     p95: 81670.9
#     p99: 84986.2
#   Scenario duration:
#     min: 483.5
#     max: 85655.1
#     median: 43278.9
#     p95: 81675.3
#     p99: 84993.2
#   Scenario counts:
#     Add users: 1000 (100%)
#   Codes:
#     202: 1000


### Docker containers 5 seconds, 200 AR ###

# Summary report @ 17:35:43(-0800) 2018-03-02
#   Scenarios launched:  1000
#   Scenarios completed: 1000
#   Requests completed:  1000
#   RPS sent: 10.43
#   Request latency:
#     min: 151.1
#     max: 90707.2
#     median: 45443
#     p95: 86350.9
#     p99: 89964.9
#   Scenario duration:
#     min: 483.3
#     max: 90755.2
#     median: 45490.6
#     p95: 86399.1
#     p99: 90012.7
#   Scenario counts:
#     Add users: 1000 (100%)
#   Codes:
#     202: 1000

### Docker swarm 5 seconds, 200 AR, 5 replicas

# Summary report @ 19:27:41(-0800) 2018-03-02
#   Scenarios launched:  1000
#   Scenarios completed: 1000
#   Requests completed:  1000
#   RPS sent: 5.15
#   Request latency:
#     min: 1336.1
#     max: 189016.7
#     median: 99298.9
#     p95: 180202.7
#     p99: 187423.1
#   Scenario duration:
#     min: 1339.3
#     max: 189017.4
#     median: 99299.8
#     p95: 180203.5
#     p99: 187423.8
#   Scenario counts:
#     Add users: 1000 (100%)
#   Codes:
#     202: 1000